# ПЕРЕМЕННЫЕ
# https://www.reg.ru/blog/5-klassnyh-veschej-kotorye-vy-mozhete-osvoit-s-python/
# 5 вещей, которые вы можете освоить с Python

# ЗАДАЧА
"""Задача:
Напишите 4 переменных которые буду обозначать следующие данные:
Количество выполненных ДЗ (запишите значение 12)
Количество затраченных часов (запишите значение 1.5)
Название курса (запишите значение 'Python')
Время на одно задание (вычислить используя 1 и 2 переменные)
Выведите на экран(в консоль), используя переменные, следующую строку:
Курс: Python, всего задач:12, затрачено часов: 1.5, среднее время выполнения 0.125 часа."""

_sum_ex = 12
_sum_hour = 1.5
_kurs = 'Python'
_t_ex = 1.5/12
print('Курс: '+_kurs+', всего задач:'+str(_sum_ex)+', затрачено часов: '+str(_sum_hour)+', среднее время выполнения '+str(_t_ex)+' часа.')